/* E13 ДЗ 5
Вторая с конца ноль 
Считать массив из 10 элементов и отобрать в другой массив все числа, 
у которых вторая с конца цифра 
(число десятков) – ноль. */
/*  Данные на входе:        10 целых чисел через пробел. 
Данные на выходе:   Целые числа через пробел, у которых вторая 
с конца цифра - ноль 
Пример
Данные на входе:        40 105 203 1 14 1000 22 33 44 55 
Данные на выходе:   105 203 1 1000  */

#include <stdio.h>

void vib(int* mas, int i)
{    
    int n, mas2[10]={0};
    for(i =0; i<10;i++)  {        
        if ((mas[i]/10%10)==0){
                mas2[n]=mas[i];
                n++;
        } 
    }
    printf("\n"); 
    for(i =0; i<n;i++)  {               
        printf("%d ", mas2[i]);
    }         
    printf("\n");    
}   

int main(int argc, char *argv[]) 
{
    int i ;
    int mas[10]={0};    
    printf("Input number:\n");       
    for(i = 0; i<10;i++)  {
        scanf("%d", &mas[i]);
    }        
    vib (mas, 10);          
    return 0;
}
